# -*- coding: utf-8 -*-
"""
Dictionary of most common Russian words with their Belorussian counterparts
"""

# Instructions: Please add the translation of each word as seen in the first line; after : and inside quotation marks. 
# The commented number is the frequency, you can ignore it.
# In case of multiple translations, choose the most frequent word. If the translation is equally frequent, please mention both words, e.g. "the" (English) : "der", "die", "das" (German)
ru_be_dict = {
    "и" : "і" #771273
"в" : "у" #761383
"на" : "на" #323262
"с" : "з" #237650
"не" : "не", "ня" #213694
"что" : "што" #210355
"для" : "для" #155222
"по" : "па" #146415
"к" : "да" #115117
"как" : "як" #113104
"В" : "у" #103823
"или" : "цi" #93674
"из" : "з" #87987
"от" : "ад" #84302
"а" : "а" #76857
"о" : "о" #76749
"это" : "гэта" #73573
"за" : "за" #65310
"его" : "яго" #57503
"также" : "таксама" #56544
"чтобы" : "каб" #54090
"их" : "iх" #52999
"то" : "то" #51433
"которые" : "якiя" #51214
"все" : "усе" #46361
"но" : "але" #46245
"он" : "ён" #44980
"более" : "больш" #44097
"может" : "можа" #43636
"того" : "таго" #43443
"мы" : "мы" #41927
"время" : "час" #41375
"они" : "яны" #41280
"до" : "да" #40832
"будет" : "будзе" #39411
"только" : "толькi" #37639
"бы" : "бы" #36902
"так" : "так" #36441
"года" : "года" #36197
"же" : "жа" #36176
"–" : #35995 Is there any meaning in this or it just escaped from punctuation strip? /No meaning here, it's just a punctuation mark
"быть" : "быць" #35635
"я" : "я" #35483
"при" : "пры" #34734
"том" : "тым" #33857
"если" : "калi" #33846
"было" : "было" #33796
"является" : "з'яўляецца" #32389
"у" : "у" #32016
"вы" : "вы" #31091
"во" : "у" #29560
"когда" : "калi" #29556
"был" : "быў" #28640
"были" : "былi" #27727
"чем" : "чым" #26960
"могут" : "могуць" #26883
"ее" : "яе" #26791
"году" : "году" #26710
"который" : "які" #26668
"Но" : "але" #26656
"Это" : "гэта" #25760
"можно" : "можна" #25112
"США" : "ЗША" #24954
"этого" : "гэтага" #24690
"Если" : "калі" #24282
"этом" : "гэтым" #23285
"со" : "з", "са" #23159
"еще" : "яшчэ" #22977
"должны" : "павінны" #22662
"между" : "паміж" #21883
"И" : "і" #21530
"после" : "пасля" #21452
"уже" : "ужо", "ўжо" #20973
"лет" : "гадоў" #20735
"всех" : "усіх", "ўсіх" #20567
"она" : "яна" #20101
"есть" : "ёсць" #19821
"Я" : "я" #19564
"была" : "была" #19159
"этой" : "гэтай" #19157
"страны" : "краіны" #19114
"больше" : "больш" #18864
"г" : "г" #18736
"будут" : "будуць" #18694
"очень" : "вельмі" #18668
"даже" : "нават" #18312
"других" : "іншых" #18120
"которая" : "якая" #18048
"тем" : "тым" #18017
"На" : "на" #17559
"всего" : "усяго", "ўсяго" #17206
"ли" : "ці" #16616
"себя" : "сябе" #16497
"где" : "дзе" #16366
"Мы" : "мы" #16272
"под" : "пад" #16177
"стран" : "краін" #15857
"образом" : "чынам", "вобразам" #15796
"России" : "Расеі" #15615
"об" : "аб" #15481
"которых" : "якіх" #15422
"Он" : "ён" #15295
"области" : "вобласці" #15255
"эти" : "гэтыя" #15255
"Вы" : "вы" #15067
"людей" : "людзей" #15028
"без" : "без" #15017
"Для" : "для" #14873
"них" : "іх" #14734
"этих" : "гэтых" #14669
"системы" : "сістэмы" #14353
"данных" : "дадзеных" #14276
"этот" : "гэты" #14013
"Однако" : "аднак" #13996
"случае" : "выпадку" #13860
"развития" : "развіцця" #13608
"ни" : "ні" #13422
"компании" : "кампаніі" #13301
"через" : "праз" #13243
"работы" : "працы", "работы" #13206
"своей" : "сваёй" #13071
"С" : "з" #12972
"жизни" : "жыцця" #12886
"По" : "па" #12714
"свои" : "свае" #12676
"своих" : "сваіх" #12585
"свою" : "сваю" #12523
"безопасности" : "бяспекі" #12439
"Как" : "як" #12298
"кто" : "хто" #12244
"нас" : "нас" #12213
"один" : "адзін" #12212
"человека" : "чалавека" #12180
"времени" : "часу" #11983
"им" : "ім" #11787
"стороны" : "бакі" #11620
"тех" : "тых" #11594
"несколько" : "некалькі" #11576
"являются" : "з'яўляюцца" #11539
"другие" : "іншыя", "другiя" #11340
"имеет" : "мае" #11315
"которой" : "якой" #11185
"против" : "супраць" #10991
"нет" : "не" #10764
"должен" : "павінен" #10756
"течение" : "плынь" #10720
"необходимо" : "неабходна" #10719
"менее" : "менш", "меней" #10677
"таких" : "такіх" #10630
"информации" : "інфармацыі" #10555
"например" : "напрыклад" #10546
"раз" : "раз" #10534
"возможность" : "магчымасць" #10485
"мира" : "мiра", "свету" #10483
"связи" : "сувязі" #10474
"которое" : "якое" #10423
"А" : "а" #10306
"деятельности" : "дзейнасці" #10300
"просто" : "проста" #10287
"странах" : "краiнах" #10226
"вам" : "вам" #10206
"потому" : "таму" #10061
"человек" : "чалавек" #10006
"качестве" : "якасці" #9962
"лишь" : "толькі" #9956
"мире" : "свеце" #9874
"нам" : "нам" #9718
"политики" : "палітыкі" #9706
"управления" : "кіравання" #9700
"При" : "пры" #9496
"год" : "год" #9442
"использовать" : "выкарыстоўваць" #9405
"Они" : "яны" #9395
"проблемы" : "праблемы" #9327
"такие" : "такія" #9241
"программы" : "праграмы" #9216
"отношении" : "адносінах" #9191
"меня" : "мяне" #9006
"сделать" : "зрабіць" #8995
"над" : "над" #8976
"день" : "дзень" #8975
"люди" : "людзі" #8903
"перед" : "перад" #8893
"себе" : "сабе" #8787
"организации" : "арганiзацыi" #8775
"можете" : "можаце" #8765
"всегда" : "заўсёды" #8661
"власти" : "улады", "ўлады" #8655
"всем" : "усім", "ўсiм" #8610
"поскольку" : "паколькі" #8589
"мне" : "мне" #8579
"Когда" : "калi" #8578
"помощью" : "дапамогай" #8553
"включая" : "уключаючы", "ўключаючы" #8542
"К" : "к", "да", "на" #8464
"ему" : "яму" #8462
"вас" : "вас" #8446
"помощи" : "дапамогі" #8395
"много" : "шмат" #8380
"особенно" : "асабліва" #8379
    
}
